export const BUTTONS = {
  HOME: {
    MAIN: {
      SHIPMENTS: '📦 Отправки',
      ORDERS: '🧾 Заказы',
      STATISTICS: '📈 Статистика',
      WAREHOUSE: '🔧 Склад'
    }
  },
  AUTH: {
    MAIN: {
      CANCEL: '⛔ Отмена'
    }
  },
  WAREHOUSE: {
    MAIN: {
      VIEW_STOCK: 'Посмотреть количество',
      ADD_PRODUCT: 'Добавить товар',
      EDIT_PRODUCT: 'Редактировать товар',
      DELETE_PRODUCT: 'Удалить товар',
      ADJUST_STOCK: 'Корректировка количества'
    },
    CONFIRM: {
      ADD: {
        YES: '✅ Да, добавить',
        NO: '❌ Нет, я передумал(а).'
      }
    },
    STOCK: {
      ADD: 'Приход +',
      SUBTRACT: 'Расход -'
    },
    BACK: {
      BACK_TO_WAREHOUSE: '🔙 Назад в склад'
    }
  }
} as const
